{
	"recipes": [
		{
			"name": "Victoria Sponge Cake",
			"prep_time": "20 minutes",
			"cook_time": "35 minutes",
			"oven_temp": "Gas mark 5",
			"serves": "Makes 12 slices",
			"img": "food-eggs.jpg",
			"ingredientSections": {
				"Main Ingredients": ["3 or 4 eggs", 
									 "Approx. 200g caster sugar", 
									 "Approx. 200g butter",
									 "Approx. 200g self-raising flour", 
									 "Tsp of vanilla essence"],
				"For the filling": ["Seedless raspberry jam", 
				                    "Small carton of double cream", 
								    "Tablespoon of caster sugar", 
									"Icing-sugar to decorate"]
			},
			"methodSections": {
				"Main Method": ["Weigh the eggs with the shells on and take note of the weight.", 
				                "Measure out the same amount of sugar, butter and flour. For example, if your eggs weigh 200g, then you'll need 200g of sugar, 200g of butter and 200g of flour",
								"Cream together the butter and sugar until you have a pale, fluffy mixture that looks like lightly whipped double cream",
								"Beat the eggs and slowly add it to the butter and sugar mixture. Make sure each bit of egg you add is fully incorporated before adding more, to prevent curdling.",
								"Sieve the flour and fold it into the mixture, half at a time. Don't overmix -- as soon as the flour is incorporated, stop mixing.",
								"Add a drop of vanilla essence, if you like.",
								"Grease and line either one 20cm round tin, or two smaller tins. Bake until the top of the cake is golden brown and you can poke a toothpick in the middle of the cake and it comes out clean. If the top of the cake starts to brown too fast, put a sheet of parchment paper on the top to stop it burning.",
								"Leave to cool before cutting and adding the filling."
								],
				"For the filling": ["If you've used one cake tin, rather than two, cut the cake in half",
									"Whip the double cream with a tablespoon or two of caster or icing sugar, depending on your sweet tooth.",
									"Spread a layer of jam on the bottom cake.",
									"Spread the cream on top of the jam. The more the better.",
									"Put the top of the cake on, and sprinkle the top with icing sugar."]
			}
		},
		
		{
			"name": "Chicken and mushroom pie",
			"prep_time": "30 minutes",
			"oven_temp": "Gas mark 6",
			"cook_time": "35 minutes",
			"serves": "Serves 4",
			"ingredientSections": {
				"Main Ingredients": ["1 cooked chicken (about 400g)", 
									 "1 chopped onion",
									 "2 cloves of garlic, crushed",				
									 "200ml chicken stock", "3 tbsp double cream",
									 "Handful of chopped mushrooms", 
									 "1 tbsp flour",
									 "2tbsp butter", 
									 "A roll of ready-made puff pastry",
									 "1 egg"
									]
			},
			"methodSections": {
				"Main Method": ["Slowly fry the onion in oil until translucent.",
								"Add the garlic. Fry until fragrant.",
								"Add in the mushrooms.",
								"Add the chicken.",
								"Once everything is fried, set aside.",
								"Melt the butter and flour in a pan, and cook slowly for 3 minutes.",
								"Slowly whisk in the chicken stock. Don't add too much stock at a time, let each bit of stock you add be incorporated into the butter and flour mixture before you add more",
								"Mix together with the chicken and heat slightly.",
								"Season with salt and pepper as needed",
								"Grease an oven-proof dish and pour in the mixture.",
								"Roll out your puff pastry and place on top of the chicken.",
								"Brush the pastry with a beaten egg.",
								"Bake until the puff pastry has puffed up and is cooked."]
			}	
		},
		
		{
			"name": "Apple crumble",
			"prep_time": "30 minutes",
			"cook_time": "30 to 40 minutes",
			"serves": "Serves 4",
			"oven_temp": "Gas mark 5",
			"ingredientSections": {
				"Main Ingredients": [
					"3 or 4 medium dessert apples, e.g. Bramley",
					"110g caster sugar, plus 2 more tablespoons",
					"110g cold butter",
					"175g plain flour"
				]
			},
			"methodSections": {
				"Main Method": [
					"Peel and decore and quarter the apples.",
					"In a pan, heat the apples, 2 tablespoons of the sugar, and a tablespoon or two of water, depending on the liquid content of your apples.",
					"Heat the apples until soft, but not mushy.",
					"While the apples are cooking, cut the butter into squares.",
					"With your fingertips, make the crumble by rubbing together the butter, sugar and flour, until it looks like breadcrumbs.",
					"Grease an oven-proof dish and add the apple mixture.",
					"Spread the crumble on top.",
					"Sprinkle some sugar on top of that.",
					"Bake for 30 to 40 minutes, until the crumble is cooked.",
					"Serve warm with custard, cream, or ice-cream."
				]
			}
		},
		
		{
			"name": "Lasagne",
			"prep_time": "40 minutes",
			"cook_time": "20 minutes",
			"oven_temp": "Gas mark 6",
			"serves": "6 to 8",
			"ingredientSections": {
				"Main Ingredients": [
					"500g of minced beef",
					"1 chopped onion",
					"2 cloves of garlic, crushed",
					"1 carrot, chopped",
					"1 stick of celery, chopped",
					"2 tbsp tomato puree",
					"1 can of chopped tomatoes",
					"150ml beef stock",
					"2 tbsp plain flour",
					"Chopped herbs, e.g. thyme, sage, oregano"
				],
				"For the sauce": [
					"50g butter",
					"50g plain flour",
					"750ml milk",
					"Grated cheddar cheese",
					"Grated parmesan cheese",
					"Optionally - bag of spinach"
				]
			},
			"methodSections": {
				"Main Method": [
					"Heat oil in a pan and fry the onion and garlic.",
					"Add the chopped celery and fry for a few minutes.",
					"Add the mince and cook until the mince is browned.",
					"Add the flour, mix into the mince, then add the tomato puree. Cook for a few minutes.",
					"Add the stock, herbs, chopped tomatoes and carrots and bring to the boil. Simmer.",
					"Season with salt and pepper as needed.",
					"While the meat is simmering, par boil the lasagna sheets in boiling, salted water."
				],
				"For the sauce": [
					"In a saucepan add the butter and flour and cook until the flour smells toasted.",
					"Gradually add the milk, whisking continuously until the sauce has thickened.",
					"Add the cheddar cheese, leaving some to put on top of the lasagne."
				],
				"Putting it together": [
					"If using, blanche the spinach.",
					"Layer the meat and lasagne.",
					"Add the spinach to the last layer of lasagne, then pour over the white sauce.",
					"Sprinkle the cheddar and parmesan over the sauce.",
					"Bake for 20 minutes or until the cheese is melted and bubbling."
				]
			}
		}
			
	]
}
			